\documentclass{article}
\usepackage{sagetex}

\begin{document}
	
	\begin{sageexample}
		sage: 2+2
		4
		sage: print('middle')
		middle
		sage: factor(x^2 + 2*x + 1)
		sage: (x + 1)^2
		sage: (x+3)^2
		sage: 
	\end{sageexample}


	
\end{document}
